// 6.2_Array_002.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
using namespace std;

int main()
{
    int a[10];

	//和C语言里一样，数组名就是数组第一个元素所在的内存地址。
	//数组名是一个常量，不能被重新赋值。
	cout << a << endl;
	cout << &a[0] << endl;
	/*
	a = &a[1];
	*/

	//一维数组的初始化：
	//方式1.列出全部元素的初始值。
	int b[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
	//方式2.列出部分元素的初始值。（从前往后，未给出特定值的特定成员似乎会被初始化为0）
	int c[10] = { 1, 2, 3, 4, 5 };
	cout << c[5] << endl;
	//方式3.列出所有元素的初始值时，可以指定数组长度。此时根据给出的初始值个数确定数组长度。
	int d[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };


	//二维素组的初始化
	//方式1.列出全部元素初始值。
	int e[3][4] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 };
	//方式2.分行列出二维数组初始值。
	int f[3][4] = { {1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12} };
	//方式3.可以只对部分元素（前若干个）进行初始化。
	int g[3][4] = { {1}, {0, 6}, {0, 0, 1, 1} };
	//方式4.列出全部初始值时，可以省略第一维的下标数。
	int h[][4] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 };

	//如果未对数组进行初始化。
	//局部作用域的非静态数组，默认值为垃圾数据；静态数组默认值为0。
	//对于数组中部分值进行初始化，剩下未显式初始化的值将被自动初始化为0。
}
