// 6.13_Supplement_005_PointerAndArray.cpp : This file contains the 'main' function. Program execution begins and ends there.
//写这部分程序是因为在实验中我看到“int **a = new int *[]”这样的写法。
//按之前总结的，“int *[]”是 一个指针数组，那么应该只能用一个“int (*ptr)[]”才能指向它，但为什么现在又可以用双重指针指向它了呢？

#include <iostream>

int main()
{
    //0.总体结论：直接包含成员的那个数组的数组名会根据成员的类型被视为不同类型的指针。但再外层的数组就不会被视为指向直接包含成员数组这个指针的指针了。
    int num = 1;

    //1.a是一个三维的指针数组。
    int *a[2][2][2] = { &num };
    //1.a[0][0][0]本身就是一个数组成员，这个成员的数据类型是int型的指针。
    int *b1_1 = a[0][0][0];
    int b1_2 = *a[0][0][0];
    //2.a[0][0]作为指向指针成员a[0][0][0]的数组名，其类型既是一个有2个成员的指针一维数组，也是一个指针的指针。
    //2.指向指针数组的指针的写法是：*(*指针名)[]。
    int **b2_1 = &a[0][0][0];
    int *(*b2_2)[2] = &a[0][0];
    int **b2_3 = a[0][0];
    //3.a[0]作为指向一维指针数组a[0][0]的数组名，其类型却只是一个有2个一维指针数组成员的二维指针数组，不再是一个指向指针的指针的指针。
    int *(*b3_1)[2] = &a[0][0];
    int *(*b3_2)[2] = a[0];
    int *(*b3_3)[2][2] = &a[0];
    //3.可以用三重指针指向之前的双重指针，但不能再用a[0]去初始化三重指针了。因为a[0]被认为指向一维数组a[0][0]。
    int ***b3_4 = &b2_1;
    /*
    int ***b3_4 = a[0];
    */
    //4.a作为指向二维数组a[0]的数组名，其类型只是一个有2个二维指针数组成员的三维指针数组，不再是一个指向指针的指针的指针的指针。
    int *(*b4_1)[2][2] = &a[0];
    int *(*b4_1)[2][2] = a;
    int *(*b4_2)[2][2][2] = &a;
    //4.可以用四重指针指向之前的三重指针，但不能再用a去初始化四重指针了。因为a被认为指向二维数组a[0]。
    int ****b4_3 = &b3_4;
    /*
    int ****b4_4[2][2] = a;
    */

    //5.c是一个三维的数组。
    int c[2][2][2] = { num };
    //6.c[0][0][0]本身就是一个数组成员，这个成员的数据类型是int类的数。
    int *d1_1 = &c[0][0][0];
    //7.c[0][0]作为指向int成员c[0][0][0]的数组名，其类型既是一个有2个成员的一维数组，也是一个指针。
    int *d2_1 = &c[0][0][0];
    int *d2_2 = c[0][0];
    int(*d2_3)[2] = &c[0][0];
    int *d2_4 = d1_1;
    //8.c[0]作为指向一维数组c[0][0]的数组名，其类型只是一个有2个一维数组的二维数组，不是一个指向指针的指针。
    int(*d3_1)[2] = &c[0][0];
    int(*d3_2)[2] = c[0];
    int(*d3_3)[2][2] = &c[0];
    //8.可以用双重指针指向之前的指针，但不能再用c[0]去初始化双重指针了。因为c[0]被认为指向一维数组c[0][0]。
    int **d3_4 = &d2_4;
    /*
    int **d3_4 = c[0];
    */
    //9.c作为一个指向二维数组c[0]的数组名，其类型是一个有2个一维数组的的数组三维数组，不是一个指向指针的指针的指针。
    int(*d4_1)[2][2] = &c[0];
    int(*d4_2)[2][2] = c;
    int(*d4_3)[2][2][2] = &c;
    //9.可以用三重指针指向之前的指针，但不能再用c去初始化三重指针了。因为c被认为指向二维数组c[0]。
    int ***d4_4 = &d3_4;
    /*
    int ***d4_4 = c;
    */
}